/* error dialog default title */
TIME_MACHINE_ERROR = "Time Machine kunde inte slutföra säkerhetskopieringen.";

/* error dialog buttons */
OK = "OK";
PREFERENCES = "Öppna Time Machine-inställningar…";

/* string which is shown instead of the _SHOWPREFS message for managed prefs configurations */
MANAGED_PREFS = "Time Machine-inställningarna på den här datorn styrs av hanterade inställningar - kontakta en systemadministratör.";

/* error messages - shared with TMPref pane*/

// NO_ERROR
RESULTCODE_0_MESSAGE = "Inget fel.";

// BACKUP_FAILED_LAUNCH
RESULTCODE_1_MESSAGE = "Kunde inte starta Time Machine.";  

// BACKUP_FAILED_SETUP
RESULTCODE_2_MESSAGE = "Kan inte slutföra säkerhetskopieringen. Ett fel inträffade när mappen för säkerhetskopieringen skapades."; 

// BACKUP_FAILED_TARGETVOL_UNSUPPORTED_FS
RESULTCODE_3_MESSAGE = "Hårddisken för säkerhetskopiering är inte av det krävda formatet Mac OS Extended (journalförd).\n\n%@"; 
RESULTCODE_3_SHOWPREFS = "Öppna inställningarna för Time Machine för att välja en annan hårddisk för säkerhetskopiering.";

// BACKUP_FAILED_TARGETVOL_STATFS_FAILED
RESULTCODE_4_MESSAGE = "Kan inte hämta status för hårddisken för säkerhetskopiering."; 

// BACKUP_FAILED_TARGETVOL_OWNERS_DISABLED
RESULTCODE_5_MESSAGE = "Ägare har inte aktiverats på hårddisken för säkerhetskopiering. Du måste aktivera ägarskap för att använda den här hårddisken för säkerhetskopiering med Time Machine.\n\n%@"; 
RESULTCODE_5_SHOWPREFS = "Öppna inställningarna för Time Machine för att välja en annan hårddisk för säkerhetskopiering.";

// BACKUP_FAILED_TARGETVOL_NOT_JOURNALED
RESULTCODE_6_MESSAGE = "Hårddisken för säkerhetskopiering är inte av det krävda formatet Mac OS Extended (journalförd).\n\n%@";
RESULTCODE_6_SHOWPREFS = "Öppna inställningarna för Time Machine för att välja en annan hårddisk för säkerhetskopiering."; 

// BACKUP_FAILED_TARGETVOL_DISK_SPACE
RESULTCODE_7_MESSAGE = "Den här säkerhetskopieringen är för stor för hårddisken för säkerhetskopiering. Säkerhetskopian kräver %@ men endast %@ finns tillgängligt.\n\n%@";
RESULTCODE_7_SHOWPREFS = "Time Machine behöver arbetsutrymme på hårddisken för säkerhetskopiering, utöver det utrymme som krävs för lagring av säkerhetskopior. Öppna inställningarna för Time Machine om du vill välja en större hårddisk att säkerhetskopiera till, eller om du vill göra säkerhetskopian mindre genom att undanta filer."; 

// BACKUP_FAILED_TARGETVOL_READONLY
RESULTCODE_8_MESSAGE = "Filerna kunde inte kopieras eftersom hårddisken för säkerhetskopiering verkar vara skrivskyddad.\n\n%@";
RESULTCODE_8_SHOWPREFS = "Du kan behöva reparera eller formatera om hårddisken med Skivverktyg. Om hårddisken inte kan repareras måste du använda en annan hårddisk för säkerhetskopiering. Öppna Time Machine-inställningarna och välj en annan hårddisk för säkerhetskopiering."; 

// BACKUP_FAILED_TARGETVOL_ACLS_DISABLED
RESULTCODE_9_MESSAGE = "Behörighetsstyrning har inte aktiverats på hårddisken för säkerhetskopiering, vilket är ett krav.\n\n%@";
RESULTCODE_9_SHOWPREFS = "Öppna inställningarna för Time Machine för att välja en annan hårddisk för säkerhetskopiering."; 

// BACKUP_FAILED_PREFLIGHT_STAGE
RESULTCODE_10_MESSAGE = "Ett fel inträffade under förberedelsen för säkerhetskopiering."; 

// BACKUP_FAILED_COPY_STAGE
RESULTCODE_11_HEADER = "Säkerhetskopieringen kunde inte utföras eftersom ett fel inträffade när filer kopierades till hårddisken för säkerhetskopiering.";
RESULTCODE_11_MESSAGE = "Detta kan vara ett tillfälligt fel. Försök att säkerhetskopiera igen lite senare. Om problemet kvarstår reparerar du hårddisken för säkerhetskopiering med Skivverktyg.";

// BACKUP_FAILED_LINK_SOURCE
RESULTCODE_12_MESSAGE = "Ett fel inträffade vid länkning av filer på hårddisken för säkerhetskopiering."; 

//  BACKUP_FAILED_TOO_MUCH_ACTIVITY
RESULTCODE_13_MESSAGE = "För många filer ändrades under säkerhetskopieringen."; 

// BACKUP_FAILED_SNAPSHOT_DELETE_FAILED 
RESULTCODE_14_MESSAGE = "Ett fel inträffade vid försök att ta bort säkerhetskopieringar som löpt ut från hårddisken för säkerhetskopiering.";

// BACKUP_FAILED_CULLING_DISABLED
RESULTCODE_15_MESSAGE = "Alla säkerhetskopieringar som löpt ut har tagits bort, men hårddisken för säkerhetskopiering är fortfarande full.\n\n%@";
RESULTCODE_15_SHOWPREFS = "Öppna inställningarna för Time Machine för att välja en större hårddisk för säkerhetskopiering.";

// BACKUP_FAILED_CULLING_DATELIMIT
RESULTCODE_16_MESSAGE = "Alla säkerhetskopieringar som löpt ut har tagits bort, men hårddisken för säkerhetskopiering är fortfarande full.\n\n%@";
RESULTCODE_16_SHOWPREFS = "Öppna inställningarna för Time Machine för att välja en större hårddisk för säkerhetskopiering."; 

// BACKUP_FAILED_TARGETVOL_NOT_SPECIFIED
RESULTCODE_17_MESSAGE = "Ingen hårddisk har valts för säkerhetskopiering.\n\n%@";
RESULTCODE_17_SHOWPREFS = "Öppna inställningarna för Time Machine för att välja en hårddisk för säkerhetskopiering.";

// BACKUP_FAILED_TARGETVOL_NOT_FOUND
RESULTCODE_18_MESSAGE = "Hårddisken för säkerhetskopiering hittades inte.\n\n%@";
RESULTCODE_18_SHOWPREFS = "Se till att hårddisken för säkerhetskopiering är ansluten, eller öppna inställningarna för Time Machine för att välja en annan hårddisk för säkerhetskopiering."; 

// BACKUP_FAILED_TARGETVOL_NOT_MOUNTED
RESULTCODE_19_MESSAGE = "Hårddisken för säkerhetskopiering är inte tillgänglig."; 

// BACKUP_FAILED_DISK_IMAGE_NOT_CREATED
RESULTCODE_20_MESSAGE = "Kunde inte skapa avbilden ”%@” för säkerhetskopiering (fel %@)."; 

// BACKUP_FAILED_DISK_IMAGE_NOT_MOUNTED
RESULTCODE_21_MESSAGE = "Kunde inte komma åt avbilden ”%@” som används för säkerhetskopiering (fel %@)."; 

// BACKUP_CANCELED
RESULTCODE_22_MESSAGE = "Säkerhetskopieringen avbröts."; 

// BACKUP_FAILED_CASE_SENSITIVITY
RESULTCODE_23_MESSAGE = "En skiva du säkerhetskopierar är skiftlägeskänslig, men hårddisken för säkerhetskopiering är det inte.\n\n%@";
RESULTCODE_23_SHOWPREFS = "Öppna inställningarna för Time Machine om du vill välja att säkerhetskopiera till en annan hårddisk eller välja att inte säkerhetskopiera den skiftlägeskänsliga hårddisken."; 

// BACKUP_FAILED_DUPLICATE_VOLNAMES
RESULTCODE_24_MESSAGE = "Två av hårddiskarna som ska säkerhetskopieras har samma namn. Byt namn på en av dem."; 

// BACKUP_FAILED_NO_SOURCE_VOLUMES
RESULTCODE_25_MESSAGE = "Inga skivor som ska säkerhetskopieras finns tillgängliga. Detta kan inträffa om alla skivor finns med på listan ”Säkerhetskopiera inte”.\n\n%@";
RESULTCODE_25_SHOWPREFS = "Du kan ändra i listan genom att öppna Time Machine-inställningarna och klicka på Alternativ.";

// BACKUP_FAILED_NETWORK_INTERRUPTION
RESULTCODE_26_HEADER = "Time Machine kunde inte slutföra säkerhetskopieringen p.g.a. ett nätverksproblem.";
RESULTCODE_26_MESSAGE = "Kontrollera att datorn och hårddisken för säkerhetskopiering finns i samma nätverk och att hårddisken för säkerhetskopiering är påslagen. Försök sedan att säkerhetskopiera igen.";

// BACKUP_FAILED_DISK_INTERRUPTION
RESULTCODE_27_MESSAGE = "Hårddisken för säkerhetskopiering kan ha matats ut eller kopplats från datorn.";

// BACKUP_FAILED_TARGETVOL_DISK_SPACE_DURING_BACKUP
RESULTCODE_28_MESSAGE = "Hårddisken för säkerhetskopiering fick oväntat slut på utrymme. Time Machine försöker frigöra utrymme genom att ta bort gamla säkerhetskopior under nästa schemalagda säkerhetskopiering.\n\n%@";
RESULTCODE_28_SHOWPREFS = "Öppna inställningarna för Time Machine om du vill välja att säkerhetskopiera till en större hårddisk, eller göra säkerhetskopian mindre genom att undanta filer."; 

// BACKUP_FAILED_AUTHENTICATION_ERROR
RESULTCODE_29_MESSAGE = "Kunde inte ansluta till nätverkshårddisken för säkerhetskopiering eftersom problem uppstod med nätverksanvändarnamnet eller lösenordet.\n\n%@";
RESULTCODE_29_SHOWPREFS = "Öppna inställningarna för Time Machine så kan du välja en nätverkshårddisk för säkerhetskopiering och ange rätt användarnamn och lösenord på nytt.";

// BACKUP_FAILED_UNABLE_TO_REUSE_BACKUP
RESULTCODE_30_MESSAGE = "Ett fel uppstod vid försök att återanvända säkerhetskopian ”%@”.";

// BACKUP_FAILED_DISK_IMAGE_BUSY
RESULTCODE_31_MESSAGE = "Avbilden ”%@” för säkerhetskopiering används redan.";

// BACKUP_FAILED_DISK_IMAGE_NOT_FOUND
RESULTCODE_32_MESSAGE = "Avbilden ”%@” för säkerhetskopiering hittades inte.";

// BACKUP_FAILED_CLOCK_WRONG
RESULTCODE_33_MESSAGE = "Datorns datum och tid är fel.";

// BACKUP_FAILED_NO_PRIMARY_NETWORK_INTERFACE
RESULTCODE_34_MESSAGE = "Datorn saknar ett primärt nätverksgränssnitt.";

// BACKUP_FAILED_BOOT_COOKIE_NOT_FOUND
RESULTCODE_35_MESSAGE = "Time Machine kunde inte hitta en del av sina inställningar.\n\n%@";
RESULTCODE_35_SHOWPREFS = "Bekräfta inställningarna för Time Machine genom att öppna inställningarna för Time Machine och välja hårddisken för säkerhetskopiering igen.";

// BACKUP_FAILED_DESTINATION_COOKIE_NOT_FOUND
RESULTCODE_36_MESSAGE = "Time Machine kunde inte hitta en del av sina inställningar på hårddisken ”%@” som ska användas för säkerhetskopiering.\n\nSe till att hårddisken för säkerhetskopiering är ansluten och att det inte finns några andra anslutna hårddiskar med samma namn som hårddisken för säkerhetskopiering.\n\n%@";
RESULTCODE_36_SHOWPREFS = "Bekräfta inställningarna för Time Machine genom att öppna inställningarna för Time Machine och välja hårddisken för säkerhetskopiering igen.";

// BACKUP_FAILED_DISK_SOURCE_INTERRUPTION
RESULTCODE_37_MESSAGE = "En av hårddiskarna som säkerhetskopieras kan ha matats ut eller kopplats från datorn.";

// BACKUP_FAILED_TARGETIMAGE_READONLY
RESULTCODE_38_MESSAGE = "Time Machine kan inte använda skivavbilden eftersom den inte går att skriva på.";

// BACKUP_HC_FAILED_TARGETVOL_RESOLUTION_FAILED
RESULTCODE_40_HEADER = "Time Machine kunde inte kontrollera säkerhetskopiorna eftersom hårddisken för säkerhetskopiering inte är tillgänglig.";
RESULTCODE_40_MESSAGE = "Kontrollera att datorn och hårddisken för säkerhetskopiering finns i samma nätverk och att hårddisken för säkerhetskopiering är påslagen. Försök sedan att verifiera dina säkerhetskopior igen.";

// BACKUP_HC_FAILED_TARGETVOL_READONLY
RESULTCODE_41_HEADER = "Time Machine kunde inte kontrollera säkerhetskopiorna.";
RESULTCODE_41_MESSAGE = "Hårddisken för säkerhetskopiering verkar vara skrivskyddad.";

// BACKUP_HC_VERIFICATION_INTERRUPTED
RESULTCODE_42_HEADER = "Time Machine kunde inte kontrollera säkerhetskopiorna eftersom kontrollen avbröts.";
RESULTCODE_42_MESSAGE = "Avbrott orsakas vanligtvis av nätverksproblem. Försök igen när nätverksproblemen har lösts.";

// BACKUP_FAILED_TO_ABANDON_IMAGE
RESULTCODE_43_MESSAGE = "Time Machine kunde inte flytta den befintliga skivavbilden ”%@” för säkerhetskopiering";

// BACKUP_FAILED_TO_DELETE_IMAGE
RESULTCODE_44_MESSAGE = "Time Machine kunde inte radera den befintliga skivavbilden ”%@” för säkerhetskopiering";

// BACKUP_FAILED_UNKNOWN
RESULTCODE_999_MESSAGE = "Felkod: %@";

// BACKUP_WARNING_LOW_DISK_MESSAGE
RESULTCODE_1000_HEADER = "Hårddisken för säkerhetskopiering är nästan full.";
RESULTCODE_1000_MESSAGE = "När hårddisken för säkerhetskopiering är full kommer Time Machine att radera gamla säkerhetskopior så att nya får plats.\n\n%@";
RESULTCODE_1000_SHOWPREFS = "Om du hellre vill spara alla gamla säkerhetskopior öppnar du inställningarna för Time Machine och väljer en ny hårddisk för säkerhetskopiering.";

// BACKUP_WARNING_THINNING_START
RESULTCODE_1001_HEADER = "Hårddisken för säkerhetskopiering är full.";
RESULTCODE_1001_MESSAGE = "Time Machine raderade en eller flera säkerhetskopior för att skapa plats för nya säkerhetskopior. Den äldsta säkerhetskopian som finns kvar är: %@\n\n%@";
RESULTCODE_1001_SHOWPREFS = "Om du inte vill radera fler gamla säkerhetskopior öppnar du inställningarna för Time Machine och väljer en annan hårddisk för säkerhetskopiering."; 
RESULTCODE_1001_CHECKBOX = "Visa inte den här varningen igen";

// BACKUP_WARNING_NO_RECENT_BACKUPS
RESULTCODE_1002_MESSAGE = "Time Machine har inte säkerhetskopierat din dator på %@ dagar.\n\n%@"; 
RESULTCODE_1002_SHOWPREFS = "Se till att hårddisken för säkerhetskopiering är tillgänglig, eller öppna Time Machine-inställningarna och välj en ny hårddisk för säkerhetskopiering.";

// BACKUP_WARNING_REUSE_BACKUPS
RESULTCODE_1003_HEADER = "Vill du återanvända säkerhetskopian ”%@” med den här datorn?";
RESULTCODE_1003_MESSAGE = "Säkerhetskopian skapades på en annan dator. Om du återanvänder den här säkerhetskopian kan den inte längre användas av originaldatorn.";
REUSE_BACKUP_BUTTON = "Återanvänd säkerhetskopia";
CREATE_NEW_BACKUP_BUTTON = "Skapa ny säkerhetskopia";
ASK_LATER_BUTTON = "Säkerhetskopiera inte nu";

// BACKUP_WARNING_FIRMWARE 
RESULTCODE_1004_HEADER = "Det finns en uppdatering tillgänglig för ”%@”.";
RESULTCODE_1004_MESSAGE = "Den här uppdateringen förbättrar Time Capsules tillförlitlighet. Installera uppdateringen genom att öppna AirPort-verktyg. Det är möjligt att du måste ange Time Capsules lösenord för ”%@”.";
REMIND_LATER_BUTTON = "Uppdatera senare";
AIRPORT_UTILITY_BUTTON = "Öppna AirPort-verktyg…";

// BACKUP_WARNING_DELETE_IMAGE 
RESULTCODE_1006_HEADER = "Time Machine har slutfört verifikationen av dina säkerhetskopior. För att förbättra pålitligheten måste Time Machine skapa en ny säkerhetskopia.";
RESULTCODE_1006_MESSAGE = "Klicka på Påbörja ny säkerhetskopia så skapas en ny säkerhetskopia. Detta kommer att ta bort din nuvarande säkerhetskopiehistorik och kan ta flera timmar.\n\nKlicka på Säkerhetskopiera senare om du vill bli påmind imorgon istället. Time Machine kommer inte att utföra säkerhetskopieringar under tiden.";
CREATE_RECOVERY_IMAGE_NOW_BUTTON = "Påbörja ny säkerhetskopia";
CREATE_RECOVERY_IMAGE_ASK_LATER_BUTTON = "Säkerhetskopiera senare";

// BACKUP_WARNING_TARGETVOL_CHANGED
RESULTCODE_1008_HEADER = "Hårddisken för säkerhetskopiering har ändrat identitet jämfört med förra säkerhetskopieringen.";
RESULTCODE_1008_MESSAGE = "Hårddisken kan ha ersatts eller raderats, eller någon kan försöka lura din dator att säkerhetskopiera till fel hårddisk.";
BACKUP_WARNING_TARGETVOL_CHANGED_OK_BUTTON = "Använd den här hårddisken";
BACKUP_WARNING_TARGETVOL_CHANGED_CANCEL_BUTTON = "Säkerhetskopiera inte";

// UNITS
KB = "K";
MB = "MB";
GB = "GB";
TB = "TB";
